'use strict'

//1.1 задание-----------------------------------------------------------------------------------------------

let a = 'Hello!';
console.log(typeof(a) == 'string');

if(typeof(a) == 'string') {
    alert('Тип данных string!');
}
else {
   alert('Тип данных НЕ string!('); 
} 

//1.2 задание-----------------------------------------------------------------------------------------------

let answer = prompt('Сколько вам лет?', '');

switch (answer) {
    case '18':
        alert('Поздравляю вам 18 лет!');
        break;

    default:
        alert(`Вам ${answer} лет`);
        break;
}

//2 задание-----------------------------------------------------------------------------------------------

let i;

for(let i = 1; i <= 40; i++) console.log(i);

i = 1;
while(i <= 40) {
    console.log(i);
    i++;
}

i = 1;

do {
    console.log(i);
    i++;
} while (i <= 40);

//3 задание-----------------------------------------------------------------------------------------------

// while(1) {
//     alert('Вирус получается');
// }

//4 задание-----------------------------------------------------------------------------------------------

let number = [];
let j, endI, endJ;

for(i = 0; i < 3; i++) {
    number[i] = prompt(`Введите ${i+1} число:`, '');
    number[i] = +number[i];
}


for (i = 0, endI = number.length - 1; i < endI; i++) {
    let wasSwap = false;
    for (j = 0, endJ = endI - i; j < endJ; j++) {
        if (number[j] > number[j + 1]) {
            let swap = number[j];
            number[j] = number[j + 1];
            number[j + 1] = swap;
            wasSwap = true;
        }
    }
    if (!wasSwap) break;
}


alert(`Сортировка по возрастанию: ${number[0]} ${number[1]} ${number[2]}`);

//5 задание-----------------------------------------------------------------------------------------------

for(i = 0; i <= 15; i++) {
    if(i % 2 == 0) {
        alert(`Число ${i} - четное`);
    } else {
        alert(`Число ${i} - нечетное`);
    }  
}

//6 задание-----------------------------------------------------------------------------------------------

answer = +prompt('Введите число больше 5', '');

do {
    if(answer > 5 ) {
        alert('Поздравляю!');
        break;
    } else {
        answer = +prompt('Вы ввели число меньше 5 :( Попробуйте еще раз!', '');
    }
    if(answer == 0) break; 
} while(1);

//7 задания-----------------------------------------------------------------------------------------------

for(i = 8; i <= 20; i++) {
    if(i % 2 == 0) {
        alert(`Число ${i} - четное`);
    } 
}

//8 задание-----------------------------------------------------------------------------------------------

let sum = 0;

for(i = 0; i <= 1000; i++) {
    if((i % 3 == 0) || (i % 5 == 0)) {
        sum += i;
    }
}

alert(`Сумма всех чисел в диапозоне от 0 до 1000 которые кратны 3 ил 5 = ${sum}`);

//9 задание-----------------------------------------------------------------------------------------------

let str = prompt('Проверка на число Армстронга, введите число(3-ех значное)', '');
let value = [];

sum = 0;

for(i = 0; i < 3; i++) {
    value[i] = +str[i];
    value[i] *= value[i] * value[i]; 
    sum += value[i];
}

if(sum == +str) {alert(`Число ${str} является числом Армстронга`)}
else {alert(`Число ${str} НЕ является числом Армстронга`)}

//10 задание-----------------------------------------------------------------------------------------------

for(i = 0; i < 5; i++) {
    for(j = 0; j < i+1; j++){
        console.log('*');
    }
    console.log('\n');
}